Revit 2024 API
Reference Class
A stable reference to a geometric object in a Revit model.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class Reference : APIObject
Visual Basic
Public Class Reference _
	Inherits APIObject
Visual C++
public ref class Reference : public APIObject
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.Reference
See Also
Reference Members
Autodesk.Revit.DB Namespace